Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a building type element.
document:
The document.
name:
The building type name.
Returns:
The new building type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a building type name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.BuildingTypeName
The building type name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters.
-or-
When setting this property: The given value for name is already in use as a building type name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2018